Modules/CRM/Http/Controllers/LeadController.php

select * from `leads` where `leads`.`deleted_at` is null order by `id` desc
---
    public function leads_select()
    {
        // ->whereIn('type', [0, 1])
        $leads = Lead::orderBy('id', 'desc');
        if (!auth()->user()->can('admin-crm')) {
            $leads->where('assign_to', auth()->id());
        }
        $leads = $leads->get();

select * from `leads` where `leads`.`deleted_at` is null order by `id` desc
---
    public function leads_search(Request $request)
    {
        $searchValue = $request->searchValue;
        $leads = Lead::query();
        if (!auth()->user()->can('admin-crm')) {
            $leads->where('assign_to', auth()->id());
        }
        $leads->where(function ($query) use ($searchValue) {
            $query->orWhere('name', 'like', '%' . $searchValue . '%')
                ->orWhere('phone', 'like', '%' . $searchValue . '%')
                ->orWhere('whatsapp_phone', 'like', '%' . $searchValue . '%')
                ->orWhere('company_name', 'like', '%' . $searchValue . '%');
        });
        $leads = $leads->get();