Modules/CRM/Http/Controllers/ReportController.php

select count(*) as aggregate from `leads` where `type` = 0 and `leads`.`deleted_at` is null
---
        /*******************************************************************************************/


        $data = [
            'leads' => [
                'total' => $leads->count(),
                'statuses' => $lead_statuses,
            ],
            // 'meetings' => $meetings_return,
            'meetings' => [
                'total'             => $data_meetings->count(),
                'done'              => $meetings_done_counts->count(),
                'next_meeting'      => $meetings_next_meeting_counts->count(),
                'project_delay'     => $meetings_project_delay_counts->count(),
                'refused_offer'     => $meetings_refused_offer_counts->count(),
                'rejected'          => $meetings_rejected_counts->count(),
                'none'              => $meetings_none_counts->count(),
            ],
            'all_contracts' => [
                'total' => $contracts->count(),
                'total_amount' => $contracts->sum('total_amount'),
                'paid_amount' => $contracts->sum('paid_amount'),
                'remaining_amount' => $contracts->sum('total_amount') - $contracts->sum('paid_amount'),
                'profit_company' => $contracts->sum('profit_company'),
                'ads_amount' => $contracts->sum('ads_amount'),
                'sales_commission' => $contracts->sum('sales_commission')

select count(*) as aggregate from `services` where `services`.`deleted_at` is null
---
            'clients' => [
                'total' => $clients->count(),
            ],
            'services' => [
                'total' => $services->count()
            ],