Modules/CRM/Http/Controllers/ServiceController.php

    public function services_select()
    {
        $services = Service::latest()->get();
---
select * from `services` where `services`.`deleted_at` is null order by `created_at` desc