routes/web.php


Route::get('test',function(){

    \App\User::where('id',1)->update([

        'password'=>bcrypt(123456)

    ]);
---
update `users` set `password` = 'y2SNBy8Uf3.dok0cTLLZuAtwpNDQEuVEhpylyVGNPN2N1ivXZLs6', `users`.`updated_at` = '2020-11-19 05:20:40' where `id` = 1