<?php
return [
    'failed' => 'بيانات الاعتماد هذه غير متطابقة مع البيانات المسجلة لدينا.',
    'throttle' => 'عدد كبير جدا من محاولات الدخول. يرجى المحاولة مرة أخرى بعد :seconds ثانية.',
    'login' => 'تسجيل الدخول',
    'email' => 'البريد الإليكترونى',
    'password' => 'كلمة السر',
    'remember_me' => 'تذكرنى',
    'forgot_password' => 'هل نسيت كلمة السر ؟',
    'reset_password' => 'استرجاع كلمة السر',
    'confirm_password' => 'تأكيد كلمة السر',
    'send_password_reset_link' => 'إرسال رابط استرجاع كلمة السر',
];