Modules/HR/Http/Controllers/UserController.php

select * from `job_titles` where `job_titles`.`id` in (1)
---
    public function users_select(Request $request)
    {
        $users = User::with('jobTitle');

        if($request->has('department_name'))
        {
            $users->whereHas('department',function($q)use($request){
               $q->where('name',$request['department_name']);
            });
        }

        $users=$users->orderBy('id', 'desc')->get();