app/Http/Controllers/Admin/CRM/LeadContractController.php

select * from `leads` where `leads`.`id` in (691) and `leads`.`deleted_at` is null
---
    public function show($id)
    {
        $lead_contract = LeadContract::with($this->relation_with_profile)
        ->withCount($this->relation_with_sum_payments)
        ->whereHas('lead', function ($q) {
            $q->whereNull('deleted_at')
            ->where('type', '2');
        })

        ->find($id);