Modules/Setting/Http/Controllers/SettingController.php

    public function getByName($name)
    {
        $setting = Setting::where('name', $name)->first()->value;
---
select * from `settings` where `name` = 'data_tabel_settings_view_columns' limit 1