app/Http/Controllers/Admin/CurrenciesController.php

select * from `currencies`
---
    public function index()
    {
        $currencies=Currency::all();